In [15]:
import pandas as pd

In [2]:
s = pd.Series([3,-5,7,4],['a','b','c','d'])
print(type(s))

<class 'pandas.core.series.Series'>

In [3]:
#recordando como era una lista
thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
thisdict["brand"]

'Ford'

In [4]:
data = {"country":["perú","colombia","chile"],
        "capital":["Lima", "bogota", "santiago de chile"],
        "population":[10000,20000,30000]}
dataset = pd.DataFrame(data, 
                        columns = ["country","capital", "population"])
dataset

    country            capital  population
0      perú               Lima       10000
1  colombia             bogota       20000
2     chile  santiago de chile       30000

## tirando Valores

In [5]:
s = pd.Series([3,-5,7,4],['a','b','c','d'])
s.drop(["a","c"])

b   -5
d    4
dtype: int64

In [6]:
dataset.drop("country", axis = 1)

             capital  population
0               Lima       10000
1             bogota       20000
2  santiago de chile       30000

## Sorting and ranking values

In [7]:
data = {"country":["perú","colombia","chile"],
        "capital":["Lima", "bogota", "santiago de chile"],
        "population":[10000,20000,30000]}
dataset = pd.DataFrame(data, 
                        columns = ["country","capital", "population"])

In [17]:
dataset.country

0        perú
1    colombia
2       chile
Name: country, dtype: object

In [8]:
dataset.sort_index()

    country            capital  population
0      perú               Lima       10000
1  colombia             bogota       20000
2     chile  santiago de chile       30000

In [9]:
dataset.sort_values(by = "country")

    country            capital  population
2     chile  santiago de chile       30000
1  colombia             bogota       20000
0      perú               Lima       10000

In [10]:
dataset.rank()

   country  capital  population
0      3.0      1.0         1.0
1      2.0      2.0         2.0
2      1.0      3.0         3.0

## Saving and loading data

In [11]:
#working with csv
data = pd.read_csv("Salary_Data.csv", 
            delimiter= "," )
data.head()
data.tail()

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [12]:
data = {"country":["perú","colombia","chile"],
        "capital":["Lima", "bogota", "santiago de chile"],
        "population":[10000,20000,30000]}
df = pd.DataFrame(data, 
                columns = ["country","capital", "population"])

df.to_csv("Prueba_pandas.csv")

In [1]:
# workind with excel
pd.read_excel("Salario_excel.xlsx")

NameError: name 'pd' is not defined

In [ ]:
data = {"country":["perú","colombia","chile"],
        "capital":["Lima", "bogota", "santiago de chile"],
        "population":[10000,20000,30000]}
df = pd.DataFrame(data, 
                 columns = ["country","capital", "population"])
df.to_excel("prueba_excel.xlsx",
            sheet_name= "datos")

In [16]:
# working with more sheets
hojas = pd.ExcelFile("Salario_excel.xlsx") #lee todo el libro de excel

data = pd.read_excel(hojas, "Salary_Data") #se usa para trabajar con una hoja dentro del libro de excel
data.head()

FileNotFoundError: [Errno 2] No such file or directory: 'Salario_excel.xlsx'

## SQL query (Database Table)

In [ ]:
import pandasql

## Filter

In [ ]:
data = pd.read_csv("Salary_Data.csv", 
            delimiter= "," )
data.head()
data.tail()

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [ ]:
data = pd.read_table("Salary_Data.csv", 
                    delimiter= ",")
data.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [ ]:
s = pd.Series([3,-5,7,4],['a','b','c','d'])
s["a"]

3

In [ ]:
data = {"country":["perú","colombia","chile"],
        "capital":["Lima", "bogota", "santiago de chile"],
        "population":[10000,20000,30000]}
df = pd.DataFrame(data, 
                        columns = ["country","capital", "population"])
df

    country            capital  population
0      perú               Lima       10000
1  colombia             bogota       20000
2     chile  santiago de chile       30000

In [ ]:
df[0:2]

    country capital  population
0      perú    Lima       10000
1  colombia  bogota       20000

In [ ]:
df[0:2:1] #Saltos de 1 en 1

    country capital  population
0      perú    Lima       10000
1  colombia  bogota       20000

In [ ]:
#by position and slicing
df.iloc[[0],[0]]
df.iloc[[1],:3]
df.iloc[0:2,:2]

    country capital
0      perú    Lima
1  colombia  bogota

In [ ]:
df.iloc[[1]] #busca segun el indice de la fila

    country capital  population
1  colombia  bogota       20000

In [ ]:
# by label
df.loc[[0],["capital","country"]] #busca con elnombre de la fila

  capital country
0    Lima    perú

In [ ]:
df[df["population"]>10000]

    country            capital  population
1  colombia             bogota       20000
2     chile  santiago de chile       30000

## DataFrame information

In [ ]:
data = {"country":["perú","colombia","chile"],
        "capital":["Lima", "bogota", "santiago de chile"],
        "population":[10000,20000,30000]}
df = pd.DataFrame(data, 
                columns = ["country","capital", "population"])

In [ ]:
df.shape

(3, 3)

In [ ]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
df.columns

Index(['country', 'capital', 'population'], dtype='object')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     3 non-null      object
 1   capital     3 non-null      object
 2   population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [ ]:
df.count()

country       3
capital       3
population    3
dtype: int64

In [ ]:
data = pd.read_csv('GOOG.csv', delimiter = ",", header = None)
data.columns = ["fecha", "pagos"]

#x , y = data[] , data
data.head()
planets.rename(columns={'la columna inicial':'columna a cambiar',
                        'método':'método descubrimiento'},
               index={0:'cero',1:'uno'},
               inplace=True)

## Math with DataFrame

In [ ]:
df["population"].sum()

60000

In [ ]:
df.population.sum()

60000

In [ ]:
df["population"].cumsum()

0    10000
1    30000
2    60000
Name: population, dtype: int64

In [ ]:
df["population"].min()

10000

In [ ]:
df["population"].max()

30000

In [ ]:
df["population"].idxmin()

0

In [ ]:
df["population"].idxmax()

2

In [ ]:
df.describe()

       population
count         3.0
mean      20000.0
std       10000.0
min       10000.0
25%       15000.0
50%       20000.0
75%       25000.0
max       30000.0

In [ ]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
population,3.0,20000.0,10000.0,10000.0,15000.0,20000.0,25000.0,30000.0

In [ ]:
df["population"].mean()

20000.0

In [ ]:
df["population"].median()

20000.0

## Function with DataFame

In [ ]:
f = lambda x : x*3

In [ ]:
a = df["population"].apply(f)
a

0    30000
1    60000
2    90000
Name: population, dtype: int64

In [ ]:
df.applymap(f)

,country,capital,population
0,perúperúperú,LimaLimaLima,30000
1,colombiacolombiacolombia,bogotabogotabogota,60000
2,chilechilechile,santiago de chilesantiago de chilesantiago de ...,90000

In [ ]:
df = pd.DataFrame({
    'key' : ['A','B','C','A','B','C'],
    'value1' : range(6),
    'value2' : np.random.randint(0,100,6)
    })
df.groupby('key').transform(lambda x: x - x.mean())

   value1  value2
0    -1.5   -19.0
1    -1.5    17.5
2    -1.5   -16.0
3     1.5    19.0
4     1.5   -17.5
5     1.5    16.0

In [ ]:
def filter_func(x):
    return x['value2'].std()>5

df.groupby('key').filter(filter_func)

  key  value1  value2
0   A       0      60
1   B       1      93
2   C       2      33
3   A       3      98
4   B       4      58
5   C       5      65

## Groupby

In [ ]:
data = pd.read_csv("Salary_Data.csv", 
            delimiter= ",",
            dtype= float )
data.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [ ]:
new = data.groupby('Salary')
new

In [ ]:
new.mean().head()

         YearsExperience
Salary
37731.0              1.5
39343.0              1.1
39891.0              2.2
43525.0              2.0
46205.0              1.3

In [ ]:
df = pd.DataFrame({
    'key' : ['A','B','C','A','B','C'],
    'value1' : range(6),
    'value2' : np.random.randint(0,100,6)
    })

a = df.groupby('key')
a.mean()

     value1  value2
key
A       1.5    64.5
B       2.5    36.0
C       3.5    40.0

In [ ]:
import numpy as np
a.aggregate([min,sum,np.mean,max])

    value1              value2
       min sum mean max    min  sum  mean max
key
A        0   3  1.5   3     47  129  64.5  82
B        1   5  2.5   4     27   72  36.0  45
C        2   7  3.5   5     25   80  40.0  55

In [ ]:
a.aggregate({
            "value1": min, 
            "value2": max})

     value1  value2
key
A         0      82
B         1      45
C         2      55

In [ ]:
#imprimir varios dataframes
display(df, a.aggregate([np.mean,np.cumsum]))

  key  value1  value2
0   A       0      47
1   B       1      27
2   C       2      55
3   A       3      82
4   B       4      45
5   C       5      25

  value1        value2
    mean cumsum   mean cumsum
A    1.5    NaN   64.5    NaN
B    2.5    NaN   36.0    NaN
C    3.5    NaN   40.0    NaN
0    NaN    0.0    NaN   47.0
1    NaN    1.0    NaN   27.0
2    NaN    2.0    NaN   55.0
3    NaN    3.0    NaN  129.0
4    NaN    5.0    NaN   72.0
5    NaN    7.0    NaN   80.0

In [1]:
import pandas as pd
iris = pd.read_csv("iris_dataset.csv", delimiter = ',')
iris['species'].map({"setosa" : 1, "versicolor" : 2, "virginica" : 3}) #sustituye un valor por otro

0      1
1      1
2      1
3      1
4      1
      ..
145    3
146    3
147    3
148    3
149    3
Name: species, Length: 150, dtype: int64

In [ ]:
y + np.random.uniform(0,100) - 1850

In [ ]:
np.random.uniform(1,5)

3.1948887562679764